In [7]:
import numpy as np
import pandas as pd

data={
    "Tid":['1','2','3','4','5','6','7','8','9','10'],
    "Refund":['Yes','NO','NO','Yes','NO','NO','YES','NO','NO','NO'],
    "Marital Status":['Single','Married','Single','Married','Divorced','Married','Divorced','Single','Married','Single'],
    "Tax Income":['125K','100K','70K','120K','95K','60K','220K','85K','75K','90K'],
    "Cheat":['No','No','No','No','Yes','No','No','Yes','No','Yes']  
}
df=pd.DataFrame(data)
print(df)

print(df.loc[0])
print(df.loc[4])
print(df.loc[7])
print(df.loc[8])

  Tid Refund Marital Status Tax Income Cheat
0   1    Yes         Single       125K    No
1   2     NO        Married       100K    No
2   3     NO         Single        70K    No
3   4    Yes        Married       120K    No
4   5     NO       Divorced        95K   Yes
5   6     NO        Married        60K    No
6   7    YES       Divorced       220K    No
7   8     NO         Single        85K   Yes
8   9     NO        Married        75K    No
9  10     NO         Single        90K   Yes
Tid                    1
Refund               Yes
Marital Status    Single
Tax Income          125K
Cheat                 No
Name: 0, dtype: object
Tid                      5
Refund                  NO
Marital Status    Divorced
Tax Income             95K
Cheat                  Yes
Name: 4, dtype: object
Tid                    8
Refund                NO
Marital Status    Single
Tax Income           85K
Cheat                Yes
Name: 7, dtype: object
Tid                     9
Refund                 NO
Marital Status    Married
Tax Income            75K
Cheat                  No
Name: 8, dtype: object

In [12]:
df.iloc[3:8]
df.iloc[4:9,2:4]
df.iloc[:,1:4]

  Refund Marital Status Tax Income
0    Yes         Single       125K
1     NO        Married       100K
2     NO         Single        70K
3    Yes        Married       120K
4     NO       Divorced        95K
5     NO        Married        60K
6    YES       Divorced       220K
7     NO         Single        85K
8     NO        Married        75K
9     NO         Single        90K

In [14]:
df=pd.read_csv('iris.csv')
df.head()
df.tail(5)
print(df.to_string)

<bound method DataFrame.to_string of      sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]>

In [18]:
data=pd.read_csv('employeetable.csv')
print(data.shape[0])
print(data.shape[1])
data.info

9
10

<bound method DataFrame.info of    Employee_ID     Name Department   Age   Salary  Years_Experience  \
0        101.0    Alice         HR  29.0  50000.0               4.0
1        102.0      Bob         IT  34.0  70000.0               8.0
2        103.0  Charlie         IT  41.0  65000.0              10.0
3        104.0    Diana  Marketing  28.0  55000.0               3.0
4        105.0   Edward      Sales  38.0  60000.0              12.0
5          NaN      NaN        NaN   NaN      NaN               NaN
6          NaN      NaN        NaN   NaN      NaN               NaN
7          NaN      NaN        NaN   NaN      NaN               NaN
8          NaN      NaN        NaN   NaN      NaN               NaN

    Join_Date  Gender   Bonus  Rating
0  2020-03-15  Female  5000.0     4.5
1  2017-07-19    Male  7000.0     4.0
2  2013-06-01    Male  6000.0     3.8
3  2021-02-10  Female  4500.0     4.7
4  2010-11-25    Male  5000.0     3.5
5         NaN     NaN     NaN     NaN
6         NaN     NaN     NaN     NaN
7         NaN     NaN     NaN     NaN
8         NaN     NaN     NaN     NaN  >

In [20]:
print(data.describe())

       Employee_ID        Age       Salary  Years_Experience   Bonus    Rating
count     5.000000   5.000000      5.00000          5.000000     5.0  5.000000
mean    103.000000  34.000000  60000.00000          7.400000  5500.0  4.100000
std       1.581139   5.612486   7905.69415          3.847077  1000.0  0.494975
min     101.000000  28.000000  50000.00000          3.000000  4500.0  3.500000
25%     102.000000  29.000000  55000.00000          4.000000  5000.0  3.800000
50%     103.000000  34.000000  60000.00000          8.000000  5000.0  4.000000
75%     104.000000  38.000000  65000.00000         10.000000  6000.0  4.500000
max     105.000000  41.000000  70000.00000         12.000000  7000.0  4.700000

In [22]:
df.head(5)
df.tail(3)

     sepal_length  sepal_width  petal_length  petal_width    species
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica